Revit 2027 API
SpatialElementBoundarySubface Methods
The SpatialElementBoundarySubface type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBoundingElementFace |  Returns the face of the bounding element.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSpatialElementFace |  Returns the face of the spatial element's 3D geometry.
GetSubface |  Returns a face that represents the portion of the room face bounded by the boundary element.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace